<?php

return [
    'resource.created' => ':resource با موفقیت ایجاد شد',
    'resource.update' => ':resource با موفقیت به روز رسانی شد',
    'resource.deleted' => ':resource با موفقیت حذف شد',
    'register' => ':resource با موفقیت ثبت شد',
    'resource' => [
        'destroy' => ':resource با موفقیت حذف شد',
    ],
    'comment' => [
        'store' => 'نظر شما دریافت و پس از تایید منتشر خواهد شد',
        'destroy' => ''
    ],

    'order' => [

        'store' => 'سفارش شما با موفقیت ثبت شد',

        'updateStatus' => 'وضعیت سفارش با موفقیت تغییر یافت',

        'updateDeliveryCode' => 'کد محموله سفارش با موفقیت تغییر یافت',

        'reject' => 'سفارش با موفقیت رد شد',

    ],

    'success' => 'عملیات با موفقیت انجام شد',
    'banner' => [
        'store' => 'بنر با موفقیت ایجاد شد',
        'update' => 'بنر با موفقیت به روزرسانی شد',
        'destroy' => 'بنر با موفقیت حذف شد',
    ],
    'promo_code' => [
        'store' => 'کد تخفیف با موفقیت ایجاد شد',
        'update' => 'کد تخفیف با موفقیت به روزرسانی شد',
        'destroy' => 'کد تخفیف با موفقیت حذف شد',
    ],

    'product' => [

        'store' => 'محصول با موفقیت ایجاد شد',

        'update' => 'محصول با موفقیت به روزرسانی شد',

        'destroy' => 'محصول با موفقیت حذف شد',

        'invalidQuantity' => 'تعداد محصول انتخاب شده بیش از حد مجاز است',

    ],

    'returnRequest' => [

        'store' => 'درخواست مرجوعی با موفقیت ثبت شد',

    ],

    'productCategory' => [

        'store' => 'دسته بندی با موفقیت ایجاد شد',

        'update' => 'دسته بندی با موفقیت به روزرسانی شد',

        'destroy' => 'دسته بندی با موفقیت حذف شد',

    ],
];
